# Data Assembly

In [1]:
import pandas as pd
import numpy as np

In [2]:
DJI = pd.read_csv(
    '~/Git/MachineLearningAndBigDataWithR/Data/^DJIMonthly.csv'
    , sep = ',')
SP500 = pd.read_csv(
    '~/Git/MachineLearningAndBigDataWithR/Data/^GSPCMonthly.csv'
    , sep = ',')
FedFunds = pd.read_csv(
    '~/Git/MachineLearningAndBigDataWithR/Data/FEDFUNDS.csv'
    , sep = ',')
SS = pd.read_csv(
    '~/Git/MachineLearningAndBigDataWithR/Data/SSRetired.csv'
    , sep = ',')

In [3]:
#DJI.head()
DJI.columns = ['date', 'DJIopen', 'DJIhigh', 'DJIlow', 'DJIclose', 'DJIadjClose', 'DJIvolume']
DJI.head()

,date,DJIopen,DJIhigh,DJIlow,DJIclose,DJIadjClose,DJIvolume
0,1985-01-01,1277.719971,1305.099976,1266.890015,1286.770020,1286.770020,44450000
1,1985-02-01,1276.939941,1307.530029,1263.910034,1284.010010,1284.010010,207300000
2,1985-03-01,1285.339966,1309.959961,1242.819946,1266.780029,1266.780029,201050000
3,1985-04-01,1264.800049,1290.300049,1245.800049,1258.060059,1258.060059,187110000
4,1985-05-01,1257.180054,1320.790039,1235.530029,1315.410034,1315.410034,242250000

In [4]:
#SP500.head()
SP500.columns = ['date', 'SPopen', 'SPhigh', 'SPlow', 'SPclose', 'SPadjClose', 'SPvolume']
SP500.head()

,date,SPopen,SPhigh,SPlow,SPclose,SPadjClose,SPvolume
0,1985-01-01,167.199997,180.270004,163.360001,179.630005,179.630005,2673710000
1,1985-02-01,179.630005,183.949997,177.750000,181.179993,181.179993,2194620000
2,1985-03-01,181.179993,183.889999,176.529999,180.660004,180.660004,2153090000
3,1985-04-01,180.660004,183.610001,177.860001,179.830002,179.830002,1981880000
4,1985-05-01,179.830002,189.979996,178.350006,189.550003,189.550003,2350340000

In [5]:
df = pd.merge(DJI,SP500, how = 'inner', on = 'date')
df.head()

,date,DJIopen,DJIhigh,DJIlow,DJIclose,DJIadjClose,DJIvolume,SPopen,SPhigh,SPlow,SPclose,SPadjClose,SPvolume
0,1985-01-01,1277.719971,1305.099976,1266.890015,1286.770020,1286.770020,44450000,167.199997,180.270004,163.360001,179.630005,179.630005,2673710000
1,1985-02-01,1276.939941,1307.530029,1263.910034,1284.010010,1284.010010,207300000,179.630005,183.949997,177.750000,181.179993,181.179993,2194620000
2,1985-03-01,1285.339966,1309.959961,1242.819946,1266.780029,1266.780029,201050000,181.179993,183.889999,176.529999,180.660004,180.660004,2153090000
3,1985-04-01,1264.800049,1290.300049,1245.800049,1258.060059,1258.060059,187110000,180.660004,183.610001,177.860001,179.830002,179.830002,1981880000
4,1985-05-01,1257.180054,1320.790039,1235.530029,1315.410034,1315.410034,242250000,179.830002,189.979996,178.350006,189.550003,189.550003,2350340000

In [6]:
#FedFunds.head()
FedFunds.columns = ['date', 'fedFundRate']
FedFunds.head()

         date  fedFundRate
0  1954-07-01         0.80
1  1954-08-01         1.22
2  1954-09-01         1.06
3  1954-10-01         0.85
4  1954-11-01         0.83

In [7]:
df = pd.merge(df,FedFunds, how = 'inner', on = 'date')
df.head()

,date,DJIopen,DJIhigh,DJIlow,DJIclose,DJIadjClose,DJIvolume,SPopen,SPhigh,SPlow,SPclose,SPadjClose,SPvolume,fedFundRate
0,1985-01-01,1277.719971,1305.099976,1266.890015,1286.770020,1286.770020,44450000,167.199997,180.270004,163.360001,179.630005,179.630005,2673710000,8.35
1,1985-02-01,1276.939941,1307.530029,1263.910034,1284.010010,1284.010010,207300000,179.630005,183.949997,177.750000,181.179993,181.179993,2194620000,8.50
2,1985-03-01,1285.339966,1309.959961,1242.819946,1266.780029,1266.780029,201050000,181.179993,183.889999,176.529999,180.660004,180.660004,2153090000,8.58
3,1985-04-01,1264.800049,1290.300049,1245.800049,1258.060059,1258.060059,187110000,180.660004,183.610001,177.860001,179.830002,179.830002,1981880000,8.27
4,1985-05-01,1257.180054,1320.790039,1235.530029,1315.410034,1315.410034,242250000,179.830002,189.979996,178.350006,189.550003,189.550003,2350340000,7.97

In [8]:
#SS.head()
SS.columns = ['date', 'totalSSRetired', 'averageSSRetiredPay', 'totalMaleSSRetired', 'averageMaleSSRetiredPay', 'totalFemaleSSRetired', 'averageFemaleSSRetiredPay', 'DROPME']
SS.drop('DROPME', axis = 1, inplace=True)
SS.head()

,date,totalSSRetired,averageSSRetiredPay,totalMaleSSRetired,averageMaleSSRetiredPay,totalFemaleSSRetired,averageFemaleSSRetiredPay
0,Jan-75,"151,615",$202.94,"94,956",$224.81,"56,659",$166.27
1,Feb-75,"110,555",$195.32,"66,899",$219.05,"43,656",$158.95
2,Mar-75,"135,611",$194.87,"81,448",$218.69,"54,163",$159.05
3,Apr-75,"130,311",$194.05,"77,396",$218.78,"52,915",$157.88
4,May-75,"153,002",$194.14,"90,062",$219.47,"62,940",$157.91

In [9]:
adjDate = SS['date'].str.split("-", n = 1, expand = True)
adjDate.head()
#adjDate['combined'] = '19' + adjDate[1]
month = list(adjDate[0].unique())
numMonth = ["%.2d" % i for i in range(1,13)]
#adjDate[adjDate[0] == 'jan']['combined'] = '19' + adjDate[1] + '-01-01'
# want 1985-01-01 YYYY-MM-DD

In [10]:
adjDate.head()

     0   1
0  Jan  75
1  Feb  75
2  Mar  75
3  Apr  75
4  May  75

In [11]:
adjDate['combined'] = np.where(adjDate[0] == 'Jan', '01-01'
                               , np.where(adjDate[0] == 'Feb', '02-01'
                                          , np.where(adjDate[0] == 'Mar', '03-01'
                                                    ,np.where(adjDate[0] == 'Apr', '04-01'
                                                             ,np.where(adjDate[0] == 'May', '05-01'
                                                                      ,np.where(adjDate[0] == 'Jun', '06-01'
                                                                               ,np.where(adjDate[0] == 'Jul', '07-01'
                                                                                        ,np.where(adjDate[0] == 'Aug', '08-01'
                                                                                                 ,np.where(adjDate[0] == 'Sep', '09-01'
                                                                                                          ,np.where(adjDate[0] == 'Oct', '10-01'
                                                                                                                   ,np.where(adjDate[0] == 'Nov', '11-01'
                                                                                                                            ,np.where(adjDate[0] == 'Dec', '12-01'
                                                                                                                                     , 0))))))))))))
# adjDate[1] = '19' + adjDate[1]
adjDate['combined'] = '19' + adjDate[1] + '-' + adjDate['combined']
#adjDate.head()
SS['date'] = adjDate['combined']
SS.head()

,date,totalSSRetired,averageSSRetiredPay,totalMaleSSRetired,averageMaleSSRetiredPay,totalFemaleSSRetired,averageFemaleSSRetiredPay
0,1975-01-01,"151,615",$202.94,"94,956",$224.81,"56,659",$166.27
1,1975-02-01,"110,555",$195.32,"66,899",$219.05,"43,656",$158.95
2,1975-03-01,"135,611",$194.87,"81,448",$218.69,"54,163",$159.05
3,1975-04-01,"130,311",$194.05,"77,396",$218.78,"52,915",$157.88
4,1975-05-01,"153,002",$194.14,"90,062",$219.47,"62,940",$157.91

In [12]:
df = pd.merge(df,SS, how = 'inner', on = 'date')
df.head()

,date,DJIopen,DJIhigh,DJIlow,DJIclose,DJIadjClose,DJIvolume,SPopen,SPhigh,SPlow,SPclose,SPadjClose,SPvolume,fedFundRate,totalSSRetired,averageSSRetiredPay,totalMaleSSRetired,averageMaleSSRetiredPay,totalFemaleSSRetired,averageFemaleSSRetiredPay
0,1985-01-01,1277.719971,1305.099976,1266.890015,1286.770020,1286.770020,44450000,167.199997,180.270004,163.360001,179.630005,179.630005,2673710000,8.35,"196,866",$452.13,"120,796",$523.47,"76,070",$338.85
1,1985-02-01,1276.939941,1307.530029,1263.910034,1284.010010,1284.010010,207300000,179.630005,183.949997,177.750000,181.179993,181.179993,2194620000,8.50,"132,364",$431.50,"77,248",$511.91,"55,116",$318.81
2,1985-03-01,1285.339966,1309.959961,1242.819946,1266.780029,1266.780029,201050000,181.179993,183.889999,176.529999,180.660004,180.660004,2153090000,8.58,"157,043",$431.54,"91,422",$508.91,"65,621",$323.76
3,1985-04-01,1264.800049,1290.300049,1245.800049,1258.060059,1258.060059,187110000,180.660004,183.610001,177.860001,179.830002,179.830002,1981880000,8.27,"150,053",$427.86,"87,247",$505.74,"62,806",$319.66
4,1985-05-01,1257.180054,1320.790039,1235.530029,1315.410034,1315.410034,242250000,179.830002,189.979996,178.350006,189.550003,189.550003,2350340000,7.97,"139,229",$427.62,"81,120",$505.40,"58,109",$319.04

In [13]:
df.to_csv(path_or_buf = '~/Git/MachineLearningAndBigDataWithR/Data/assembled.csv', sep=',')